app/controllers/items_controller.rb

	def index
		@items = Item.page(params[:page]).reverse_order
---
SELECT COUNT(*) FROM "items"
SELECT  "items".* FROM "items" ORDER BY "items"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def create
		@item =Item.new(item_params)
		@item.save
---
INSERT INTO "items" ("photo_id", "genre", "brand", "season", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)