app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
	def show
		@user = User.find(params[:id])
		@items = Item.page(params[:page]).reverse_order